Show / Hide Table of Contents
Class ProjectDataConcreteEc2
Project data concrete Ec2
Inheritance
System.Object
OpenObject
ProjectDataConcrete
ProjectDataConcreteEc2
Inherited Members
 ProjectDataConcrete.DesignWorkingLife
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Concrete.Ec2.ProjectDataConcreteEc2,CI.ProjectData", "CI.Services.Concrete.IProjectDataConcrete,CI.BasicTypes", typeof(ProjectDataConcrete))]
public class ProjectDataConcreteEc2 : ProjectDataConcrete
Constructors
Improve this Doc   View Source
ProjectDataConcreteEc2()
Constructor
Declaration
public ProjectDataConcreteEc2()
Properties
Improve this Doc   View Source
CodeEN1992_2
Flag if code EN 1992-2 is included
Declaration
public bool CodeEN1992_2 { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CodeEN1992_3
Flag if code EN 1992-2 is included
Declaration
public bool CodeEN1992_3 { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source